Revit 2027 API
SpecTypeId.RotationalPointSpringCoefficient Property
 Rotational Point Spring Coefficient, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RotationalPointSpringCoefficient { get; }
Public Shared ReadOnly Property RotationalPointSpringCoefficient As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RotationalPointSpringCoefficient {
	ForgeTypeId^ get ();
}
static member RotationalPointSpringCoefficient : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace